# Classic stuff
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"

# Essential tools
brew "openssl@1.1"
brew "aria2"
brew "arp-scan"
brew "python"
brew "ccat"
brew "isl"
brew "circleci"
brew "cmatrix"
brew "emojify"
brew "erlang"
brew "exercism"
brew "git"
brew "gnupg"
brew "go"
brew "htop"
brew "zsh"
brew "make"
brew "minikube"
brew "node"
brew "opencv"
brew "pyenv"
brew "shfmt"
brew "sl"
brew "thefuck"
brew "tig"
brew "wget"
brew "yarn"
brew "poetry"
brew "pipenv"
brew "cowsay"
cask "hyper"
cask "minikube"

# Entertainment
cask "spotify"

# Browsers
cask "brave-browser"
cask "google-chrome"
cask "firefox-developer-edition"

# Passwords
cask "lastpass"
cask "keybase"

# Dev tools
cask "visual-studio-code"
cask "postman"
cask "balenaetcher"
brew "nektos/tap/act"
brew "azure-cli"

# Social?
cask "whatsapp"
cask "slack"
